Revit 2027 API
ComboBox.AddSeparator Method
Adds a separator to the drop-down list.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddSeparator()
Public Sub AddSeparator
public:
void AddSeparator()
member AddSeparator : unit -> unit
Remarks
The separator will be added below the last added member.
See Also
Reference
ComboBox Class
Autodesk.Revit.UI Namespace